spec/dummy/app/controllers/users_controller.rb

  def create
    @user = User.new
    @category = Category.new(user: @user)
    @form = UserForm.new(user: @user, category: @category)
    @form.fill_attributes(user_params)

    if @form.valid?
      @form.save
---
INSERT INTO "categories" ("created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 18 Feb 2014 11:26:05 UTC +00:00], ["title", "test"], ["updated_at", Tue, 18 Feb 2014 11:26:05 UTC +00:00], ["user_id", 5]]
INSERT INTO "users" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 16 Feb 2014 20:16:53 UTC +00:00], ["name", "Corbel"], ["updated_at", Sun, 16 Feb 2014 20:16:53 UTC +00:00]]

  def update
    @category = @user.category
    @form = UserForm.new(user: @user, category: @category)
    @form.fill_attributes(user_params)

    if @form.valid?
      @form.save
---
INSERT INTO "categories" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", Tue, 18 Feb 2014 11:13:17 UTC +00:00], ["updated_at", Tue, 18 Feb 2014 11:13:17 UTC +00:00], ["user_id", 4]]